<%@ Page Title="" Language="C#" MasterPageFile="~/MasterPage.Master" AutoEventWireup="true" CodeBehind="Hala.aspx.cs" Inherits="ShahafsWebsite.Hala" %>
<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="server">
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" runat="server">
</asp:Content>
<head>

</head>
<body>

<h1>
    המצרכים (3 מנות):
3 חלות:
1 ק״ג קמח מנופה
רבע כוס (50 גרם) סוכר
רבע כוס (60 מ"ל) שמן
1 כף שמרים יבשים
1 כף מלח
2 וחצי כוסות (600 מ"ל) מים
לציפוי:
ביצה טרופה
קורט מלח
קורט סוכר
זרעי שומשום
</h1>
<h2>
    מערבבים את כל החומרים מלבד המים כדקה (עד לאיחוד) במיקסר עם וו לישה.
    יוצקים פנימה את המים ולשים במהירות בינונית כ-6-7 דקות, עד לקבלת כדור בצק. 
    מכסים את הקערה בניילון נצמד ומעליו מניחים מגבת. מתפיחים כ-45 דקות ובודקים את המצב - אם הבצק הכפיל את נפחו ממשיכים, אם לא, נותנים לו עוד רבע שעה
    כשהבצק מכפיל את נפחו מחלקים אותו ל-3 חלקים שווים. חוצים כל חלק לשניים, כך שמתקבלים 6 חלקים שווים.
    קולעים או מעצבים את החלה: יוצרים שני גלילים מאורכים ומניחים בצורת צלב אחד על גבי השני. מתחילים להצליב את הגלילים משני הכיוונים כך שהחלה נקלעת לגובה ואז משכיבים אותה. אפשרות נוספת: חותכים כל גליל ל-4, יוצרים כדורים ומסדרים אותם בצורת כתר. חוזרים על הפעולה פעמיים נוספות, עם שאר הבצק.
    מתפיחים, מברישים ואופים: מכסים את החלות המעוצבות במגבת ומתפיחים כחצי שעה או עד שהנפח כמעט מכפיל את עצמו והחלות מתעגלות יפה. במקביל מחממים תנור ל-220 מעלות (או 200 בטורבו).
    מברישים את החלות בביצה טרופה עם מלח וסוכר, מפזרים שומשום ואופים 25 דקות, או עד שהחלות אפויות וזהובות יפה. מצננים לחלוטין ומגישים.
</h2>
    </body>