<%@ Page Title="" Language="C#" MasterPageFile="~/MasterPage.Master" AutoEventWireup="true" CodeBehind="Shakshuka.aspx.cs" Inherits="ShahafsWebsite.Shakshuka" %>
<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="server">
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" runat="server">
</asp:Content>
<body>
    <h1>
    6 עגבניות

5 ביצים

4 שיני שום

4 כפות שמן

2 כפות רסק עגבניות או מטבוחה איכותית

1 כפית פפריקה חריפה

1 כפית פפריקה מעושנת

1/2 פלפל חריף (לא חובה)

1/2 כפית סוכר

מלח ופלפל שחור
    לקישוט: פטרוזיליה או כוסברה קצוצה
</h1>
<h2>
    באמצעות סכין חדה יוצרים X בתחתית של כל עגבניה. חולטים את העגבניות מספר דקות במים רותחים, ומקלפים. קוצצים את העגבניות לקוביות.
    פורסים את השום לפרוסות דקות, ומטגנים אותו במחבת רחבה יחד עם הפפריקה החריפה והמעושנת.
    אם רוצים שקשוקה חריפה – קוצצים את הפלפל החריף ומוסיפים גם אותו למחבת. הטיגון צריך להיות מהיר – כדקה בלבד.
    מוסיפים למחבת את העגבניות הקצוצות, את המטבוחה או רסק העגבניות וכ-5 כפות מים. מערבבים היטב, מכסים ומבשלים על אש בינונית במשך 3 דקות.
    יוצרים גומות בתוך הרוטב, ופותחים ביצה אחת לתוך כל גומה (כמובן, לא לשכוח לבדוק את הביצים קודם).
    מתבלים במלח ופלפל מעל הביצים, מכסים שוב את המחבת ומבשלים כרבע שעה נוספת, או עד שהביצים מתקשות.
    מפזרים על הכל מעט פטרוזיליה או כוסברה קצוצה, ומגישים את השקשוקה כשהיא חמה. 
</h2>
</body>
