using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;
using System.Web.UI;
using System.Web.UI.WebControls;

namespace ShahafsWebsite
{
    public partial class Shinezelim : System.Web.UI.Page
    {
        public string msg = "";
        protected void Page_Load(object sender, EventArgs e)
        {
            if (Session["uFname"] == null || Session["uFname"].ToString() == "אורח")
            {
                msg += "<div style='text-align: center; color: red;'>";
                msg += "<h6 style='font-size: 25px; margin-bottom: 20px;'>אינך משתמש! אין לך הרשאה לצפות בדף זה</h6>";
                msg += "<div style='text-align: center;'>";
                msg += "<a href='Mainpage.aspx' style='font-size: 20px; color: white;'>[המשך]</a>";
                msg += "</div>";
            }
            else
            {
                msg += @"
        <body>
        <h1>
            <big>שניצילים</big>
        </h1>
        <h2>
            <big>מצרכים:</big>
        </h2>
    <h3>
    750 גרם חזה עוף טרי לשניצל מהקצב, חתוך ומנוקה
        <div></div>
4 ביצים גדולות או 5 קטנות
        <div></div>
2 כפיות חרדל
        <div></div>
1.5 כפות רוטב סויה
        <div></div>
1 כוס קמח לבן
        <div></div>
4 כפות קורנפלור
        <div></div>
3 כוסות פירורי לחם
        <div></div>
1/2 כפית מלח
        <div></div>
1/3 כפית כורכום
        <div></div>
1/2 כפית פלפל שחור
        <div></div>
</h3>
        <h4>
            <big>אופן הכנה:</big>
        </h4>
<h5>
     מוציאים את השניצלים מהמקרר ומניחים להם להגיע לטמפרטורת החדר
    <div></div>
    בינתיים, מכינים צלחות עבור הקמח, הביצים ופירורי הלחם. את פירורי הלחם מערבבים עם הקורנפלור
    <div></div>
    את הביצים טורפים עם החרדל, רוטב הסויה, המלח, הכורכום והפלפל השחור
    <div></div>
    אפשר להוסיף גם קצת צ'ילי גרוס דק או פפריקה מעושנת
    <div></div>
    מחממים במחבת שמן בעומק של 6-7 מ""מ. בודקים שהטמפרטורה מתאימה לטיגון באמצעות השלכת פירור לחם למחבת – אם הוא מוקף בבועות קטנות אז החום מתאים
    <div></div>
    אם אין בועות השמן לא חם מספיק ואם יש ממש הרבה בועות אז ייתכן שהוא מעט חם מדי
    <div></div>
    מכינים שניצל אחד לניסיון: לוקחים נתח אחד, טובלים בקמח משני הצדדים עד שהוא מתכסה יפה יפה. מנערים כדי לסלק עודפי קמח וטובלים בבלילת הביצה הטרופה
    <div></div>
    מוציאים מהבלילה, מחזיקים רגע באוויר מעל לצלחת ונותנים לעודפי הבלילה לזלוג חזרה אליה, ואז מעבירים את השניצל לצלחת עם פרורי הלחם
    <div></div>
    הופכים ומכסים בפירורים ולוחצים בכף יד פתוחה, עד שהשניצל עטוף יפה ולא דביק. מנערים קצת ומחליקים למחבת
    <div></div>
    השמן אמור לרחוש כשאתם מכניסים לתוכו את השניצל – אם הוא ממש מרעיש הקטינו את האש. טגנו 2-3 דקות
    <div></div>
    מכל צד וכשהצבע יפה הוציאו למסננת שמונחת מעל קערה או צלחת (עדיף מנייר סופג)
    <div></div>
    טועמים מהשניצל הראשון כדי לתקן את התיבול של הבלילה לפי הצורך, וממשיכים לשאר השניצלים
</h5>
        </body>";
            }
        }
    }
}