<%@ Page Title="" Language="C#" MasterPageFile="~/MasterPage.Master" AutoEventWireup="true" CodeBehind="Shinezelim.aspx.cs" Inherits="ShahafsWebsite.Shinezelim" %>
<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="server">
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" runat="server">
</asp:Content>
<body>
    <h1>
    750 גרם חזה עוף טרי לשניצל מהקצב, חתוך ומנוקה
4 ביצים גדולות או 5 קטנות
2 כפיות חרדל
1.5 כפות רוטב סויה
1 כוס קמח לבן
4 כפות קורנפלור
3 כוסות פירורי לחם
1/2 כפית מלח
1/3 כפית כורכום
1/2 כפית פלפל שחור
</h1>
<h2>
     מוציאים את השניצלים מהמקרר ומניחים להם להגיע לטמפרטורת החדר.
    בינתיים, מכינים צלחות עבור הקמח, הביצים ופירורי הלחם. את פירורי הלחם מערבבים עם הקורנפלור.
    את הביצים טורפים עם החרדל, רוטב הסויה, המלח, הכורכום והפלפל השחור.
    אפשר להוסיף גם קצת צ'ילי גרוס דק או פפריקה מעושנת.
    מחממים במחבת שמן בעומק של 6-7 מ"מ. בודקים שהטמפרטורה מתאימה לטיגון באמצעות השלכת פירור לחם למחבת – אם הוא מוקף בבועות קטנות אז החום מתאים.
    אם אין בועות השמן לא חם מספיק ואם יש ממש הרבה בועות אז ייתכן שהוא מעט חם מדי.
    מכינים שניצל אחד לניסיון: לוקחים נתח אחד, טובלים בקמח משני הצדדים עד שהוא מתכסה יפה יפה. מנערים כדי לסלק עודפי קמח וטובלים בבלילת הביצה הטרופה.
    מוציאים מהבלילה, מחזיקים רגע באוויר מעל לצלחת ונותנים לעודפי הבלילה לזלוג חזרה אליה, ואז מעבירים את השניצל לצלחת עם פרורי הלחם.
    הופכים ומכסים בפירורים ולוחצים בכף יד פתוחה, עד שהשניצל עטוף יפה ולא דביק. מנערים קצת ומחליקים למחבת.
    השמן אמור לרחוש כשאתם מכניסים לתוכו את השניצל – אם הוא ממש מרעיש הקטינו את האש. טגנו 2-3 דקות
    מכל צד וכשהצבע יפה הוציאו למסננת שמונחת מעל קערה או צלחת (עדיף מנייר סופג).
    טועמים מהשניצל הראשון כדי לתקן את התיבול של הבלילה לפי הצורך, וממשיכים לשאר השניצלים.
</h2>

</body>
